[
  {
    "en": "O Allah, on this day make my fasts the fasts of those who fast (sincerely), and my standing up in prayer of those who stand up in prayer (obediently), awaken me in it from the sleep of the heedless, and forgive me my sins , O God of the worlds, and forgive me, O one who forgives the sinners",
    "ar": "اَللّـهُمَّ اجْعَلْ صِيامي فيهِ صِيامَ الصّائِمينَ، وَقِيامي فيهِ قيامَ الْقائِمينَ، وَنَبِّهْني فيهِ عَنْ نَوْمَةِ الْغافِلينَ، وَهَبْ لى جُرْمي فيهِ يا اِلـهَ الْعالَمينَ، وَاعْفُ عَنّي يا عافِياً عَنْ الْمجْرِمينَ",
    "trans": "Allahumaj al siyami fihi siyamasaa imina wa kiyami fihi kiyamal kaa imina wa nabhini fihi an naumatil gafilina wahabli jurmi fihi ya ilahal almina wafu anni ya afian anil mujrimin"
  },
  {
    "en": "O Allah, on this day, take me closer towards Your pleasure, keep me away from Your anger and punishment, grant me the opportunity to recite Your verses (of the Qur'an), by Your mercy, O the most Merciful.",
    "ar": "اَللّـهُمَّ قَرِّبْني فيهِ اِلى مَرْضاتِكَ، وَجَنِّبْني فيهِ مِنْ سَخَطِكَ وَنَقِماتِكَ، وَوَفِّقْني فيهِ لِقِرآءَةِ آياتك بِرَحْمَتِكَ يا اَرْحَمَ الرّاحِمينَ",
    "trans": "Allahuma karibni fihi ila mardatika wajanibni fihi min sakhatikawa nakima tika wa wafikni fihi likiraa ati ayatikabi rehmatika ya arhamar rahimin"
  },
  {
    "en": "O Allah, on this day, grant me wisdom and awareness, keep me away from foolishness and pretention, grant me a share in every blessing You send down, by You generosity, O the most Generous.",
    "ar": "اَللّـهُمَّ ارْزُقْني فيهِ الذِّهْنَ وَالتَّنْبيهَ ، وَباعِدْني فيهِ مِنَ السَّفاهَةِ وَالَّتمْويهِ ، وَاجْعَلْ لى نَصيباً مِنْ كُلِّ خَيْر تُنْزِلُ فيهِ، بِجُودِكَ يا أجود الاْجْوَدينَ",
    "trans": "Allahumar zukani fihizzih nawat tabiha wabaidnifihi minsafahati watawihi wajaali nafsiban minkuli khairin tunzilu fihi bijudka ya ajwadal ajwadina"
  },
  {
    "en": "O Allah, on this day, strengthen me in carrying out Your commands, let me taste the sweetness of Your rememberance, grant me, through Your graciousness, that I give thanks to You. Protect me, with Your protection and cover, O the most discerning of those who see.",
    "ar": "اَللّـهُمَّ قَوِّني فيهِ عَلى إقامة أمرك، وأذقني فيهِ حَلاوَةَ ذِكْرِكَ، وَاَوْزعْني فيهِ لاِداءِ شُكْرِكَ بِكَرَمِكَ، وَاحْفَظْني فيهِ بِحِفْظِكَ وَسَتْرِكَ، يا أبصر النّاظِرينَ",
    "trans": "Allahumma kauwini fihi alaikamati amrica wa azikuni fihi alawati zikrika wa auzini fihi li adaai shukrika bikaramika wajfazani fihi bihifzika wasitrika ya absaran nazirin"
  },
  {
    "en": "O Allah, on this day, place me among those who seek forgiveness. Place me among Your righteous and obedient servants, and place me among Your close friends, by Your kindness, O the most Merciful",
    "ar": "اَللّـهُمَّ اجْعَلْني فيهِ مِنْ الْمُسْتَغْفِرينَ، وَاجْعَلْني فيهِ مِنْ عِبادِكَ الصّالِحينَ اْلقانِتينَ ، وَاجْعَلني فيهِ مِنْ اَوْلِيائِكَ الْمُقَرَّبينَ، بِرَأْفَتِكَ يا اَرْحَمَ الرّاحِمينَ",
    "trans": "Allahuma jualni fihi minal mustagfirina wajalni fihi minibadikas salihinal kanitina wajaalni fihi min auliyaa ikalmukarrabina bira u fatika ya arhamar rahimin"
  },
  {
    "en": "O Allah, on this day, do not let me abase myself by incurring Your disobedience, and do not strike me with the whip of Your punishment, keep me away from the causes of Your anger, by Your kindness and Your power, O the ultimate wish of those who desire.",
    "ar": "اللّـهُمَّ لا تَخْذُلْني فيهِ لِتَعَرُّضِ مَعْصِيَتِكَ، وَلا تَضْرِبْني بِسِياطِ نَقِمَتِكَ، وَزَحْزِحْني فيهِ مِنْ مُوجِباتِ سَخَطِكَ ، بِمَنِّكَ وأياديك يا مُنْتَهى رَغْبَةِ الرّاغِبينَ",
    "trans": "Allahumma latakhzulni fihi litarrudi masiyatika walatadribni bisiyati nakimatika wazhazini fihi min mujibati sakhatika bimannika waayadika yamuntaha ragbatir ragibin"
  },
  {
    "en": "O Allah, on this day, help me with its fasts and prayers, and keep me away from mistakes and sins of the day, grant me that I remember You continously through the day, by Your assistance, O the Guide of those who stray.",
    "ar": "اَللّـهُمَّ اَعِنّي فِيهِ عَلى صِيامِهِ وَقِيامِهِ، وَجَنِّبْني فيهِ مِنْ هَفَواتِهِ وَآثامِهِ، وَارْزُقْني فيهِ ذِكْرَكَ بِدَوامِهِ، بِتَوْفيقِكَ يا هادِيَ الْمُضِلّينَ",
    "trans": "Allahuma ainna fihi alasiyamihi wakiyamihi wajanibni fihi minhafawatihi wasamihi warzukuni fihi zikraka bidawamihi bitaufikika yahadial mudilina"
  },
  {
    "en": "O Allah, on this day, let me have mercy on the orphans, and feed [the hungry], and spread peace, and keep company with the noble­minded, O the shelter of the hopeful.",
    "ar": "اَللّـهُمَّ ارْزُقْني فيهِ رَحْمَةَ الأيتام، وإطعام اَلطَّعامِ، وإفشاء السَّلامِ، وَصُحْبَةَ الْكِرامِ، بِطَولِكَ يا ملجأ الآملين",
    "trans": "Allahumar zukani fihi rahmatal aytami waitamata amiwa ifshaa asalami wasuhbatalkira mibitau lika yamal jal amilina"
  },
  {
    "en": "O Allah, on this day, grant me a share from Your mercy which is wide, guide me towards Your shining proofs, lead me to Your all encompassing pleasure, by Your love, O the hope of the desirous.",
    "ar": "اللّـهُمَّ اجْعَلْ لي فيهِ نَصيباً مِنْ رَحْمَتِكَ الْواسِعَةِ، وَاهْدِني فيهِ لِبَراهينِكَ السّاطِعَةِ، وَخُذْ بِناصِيَتي اِلى مَرْضاتِكَ الْجامِعَةِ، بِمَحَبَّتِكَ يا أمل الْمُشْتاقينَ",
    "trans": "Allahumaj alli fihi nasiban min rahmatikal wasiati wahdin fihi libarahin ikaasa tiatiwakhuz bina siyati ila mardatikal jamiati bama hadatika ya amalal mushtakina"
  },
  {
    "en": "O Allah, on this day, make me, among those who rely on You, from those who You consider successful, and place me among those who are near to you, by Your favour, O goal of the seekers.",
    "ar": "اَللّـهُمَّ اجْعَلْني فيهِ مِنَ الْمُتَوَكِّلينَ عَلَيْكَ، وَاجْعَلْني فيهِ مِنَ الْفائِزينَ لَدَيْكَ، وَاجْعَلْني فيهِ مِنَ الْمُقَرَّبينَ اِلَيْكَ، بإحسانك يا غايَةَ الطّالِبينَ",
    "trans": "Allahumaj alni fihi minalmutawakilina alayka wajalni fihi minal faizina ladaykawajalni fihi minalmukarabina ilayka bihsan nikaya fayatatalibina"
  },
  {
    "en": "O Allah, on this day, make me love goodness, and dislike corruption and disobedience, bar me from anger and the fire [of Hell], by Your help, O the helper of those who seek help.",
    "ar": "اَللّـهُمَّ حَبِّبْ اِلَيَّ فيهِ الإحسان، وَكَرِّهْ اِلَيَّ فيهِ الْفُسُوقَ وَالْعِصْيانَ، وَحَرِّمْ عَلَيَّ فيهِ السَّخَطَ وَالنّيرانَ بِعَوْنِكَ يا غِياثَ الْمُسْتَغيثينَ",
    "trans": "Allahuma habbib ilayay fihil ihsana wakariyu illaiya fihil fusukawal isyana waharrim alliya fihis sakhata wannirana biaunika yagiyasal mustagisina"
  },
  {
    "en": "O Allah, on this day, beautify me with covering and chastity, cover me with the clothes of contentment and chastity, let me adhere to justice and fairness, and keep me safe from all that I fear, by Your protection, O the protector of the frightened.",
    "ar": "اَللّـهُمَّ زَيِّنّي فيهِ بِالسِّتْرِ وَالْعَفافِ، وَاسْتُرْني فيهِ بِلِباسِ الْقُنُوعِ وَالْكَفافِ، وَاحْمِلْني فيهِ عَلَى الْعَدْلِ والإنصاف، وَآمِنّي فيهِ مِنْ كُلِّ ما أخاف، بِعِصْمَتِكَ يا عِصْمَةَ الْخائِفينَ",
    "trans": "Allahumma zayini fihi bisitri walifafi wasturni fihi bilibasil kunuiwalkifa fiwajmilni fihi alla adli walinsafi waamini fihi min kulli maakhafu bismatika ya simatal kahifina"
  },
  {
    "en": "O Allah, on this day, purify me from uncleanliness and dirt, make me patient over events that are decreed, grant me the ability to be pious, and keep company with the good, by Your help, O the beloved of the destitute.",
    "ar": "اَللّـهُمَّ طَهِّرْني فيهِ مِنَ الدَّنَسِ والأقذار، وَصَبِّرْني فيهِ عَلى كائِناتِ الأقدار، وَوَفِّقْني فيهِ لِلتُّقى وَصُحْبَةِ الأبرار، بِعَوْنِكَ يا قُرَّةَ عَيْنِ الْمَساكينَ",
    "trans": "Allahumma tahirni fihi minada nasiwal afzariwasabirni fihi alakainatil akdariwa wafikni fihi litukawasuhbatil abrari biaunika yakurata ainil masakini"
  },
  {
    "en": "O Allah, on this day, do not condemn me for slips, make me decrease mistakes and errors, do not make me a target for afflictions and troubles, by Your honor, O the honor of the Muslims.",
    "ar": "اَللّـهُمَّ لا تُؤاخِذْني فيهِ بِالْعَثَراتِ، وَاَقِلْني فيهِ مِنَ الْخَطايا وَالْهَفَواتِ ، وَلا تَجْعَلْني فيهِ غَرَضاً لِلْبَلايا والآفات، بِعِزَّتِكَ يا عِزَّ الْمُسْلِمينَ",
    "trans": "Allahuma latuak akhizni fihi bilasarati waakilni fihi minal khataya wal hafawati wal taj alni fihi garadan lillbala yawal afati biizatika ya izzal muslamina"
  },
  {
    "en": "O Allah, on this day, grant me the obedience of the humble expand my chest through the repentance of the humble, by Your security, O the shelter of the fearful.",
    "ar": "اَللّـهُمَّ ارْزُقْني فيهِ طاعَةَ الْخاشِعينَ، وَاشْرَحْ فيهِ صَدْري بإنابة الْمخْبِتينَ، بأمانك يا أمان الْخائِفينَ",
    "trans": "Allahumar zukani fihi taatal khashina washraka fihi sadri biina batil mukhbitna biamanika ya amanal khaa ifina"
  },
  {
    "en": "O Allah, on this day, grant me compatability with the good, keep me away from patching up with the evil, lead me in it, by Your mercy, to the permanent abode, by Your Godship, O the God of the worlds.",
    "ar": "اَللّـهُمَّ وَفِّقْني فيهِ لِمُوافَقَةِ الأبرار، وَجَنِّبْني فيهِ مُرافَقَةَ الأشرار، وَآوِني فيهِ بِرَحْمَتِكَ اِلى دارِ الْقَـرارِ، بإلهيّتك يا اِلـهَ الْعالَمينَ",
    "trans": "Allhumma wafikni fihi limuwa fakatil abrariwajanibni fihi murafaktal asrariwa awini fihi birehmatikaila darilkararibi Lahiya tika ya ilahal alamina"
  },
  {
    "en": "O Allah, on this day, guide me towards righteous actions, fulfil my needs and hopes, O One who does not need explanations nor questions, O One who knows what is in the chests of the (people of the) world. Bless Muhammad and his family, the Pure.",
    "ar": "اَللّـهُمَّ اهْدِني فيهِ لِصالِحِ الإعمال، وَاقْضِ لي فيهِ الْحَوائِجَ والآمال، يا مَنْ لا يَحْتاجُ اِلَى التَّفْسيرِ وَالسُّؤالِ، يا عالِماً بِما في صُدُورِ الْعالَمينَ، صَلِّ عَلى مُحَمَّد وَآلِهِ الطّاهِرينَ",
    "trans": "Allahummahdini fihi liswalihil amaliwakudili fihil hawaiji walamali yaman layah taju ilatafsiri wasuali yaaliman bimafisuduril alamina saliala muhammadin walihitahirina"
  },
  {
    "en": "O Allah, on this day, awaken me with the blessings of its early mornings, Illuminate my heart with the brightness of its rays, let every part of my body follow its effects, by Your light, O the illuminator of the hearts of those who know.",
    "ar": "اَللّـهُمَّ نَبِّهْني فيهِ لِبَرَكاتِ أسحاره، وَنَوِّرْ فيهِ قَلْبي بِضياءِ أنواره، وَخُذْ بِكُلِّ أعضائي اِلَى إتباع آثارِهِ، بِنُورِكَ يا مُنَوِّرَ قُلُوبِ الْعارِفينَ",
    "trans": "Allahumma nabihni fihi libarakatias harihiwanawirfihi kalbi biyaa ianwarihi wakhuzbikulli adai ilatibai asarihibinuri kayamunavira kulubil arifina"
  },
  {
    "en": "O Allah, on this day, multiply for me its blessings, and ease my path towards its bounties, do not deprive me of the acceptance of its good deeds, O the Guide towards the clear truth.",
    "ar": "اللّهُمّ وَفّرْ فِيهِ حَظّي مِنْ بَرَكَاتِهِ،وَسَهّلْ سَبِيلِي إِلَى خَيْرَاتِهِ،وَلا تَحْرِمْنِي قَبُولَ حَسَنَاتِهِ،يَا هَادِياً إِلَى الحَقّ المُبِينِ",
    "trans": "Allahumma wafer fihi hazimin barakatihi wasahil sayili ilakhairatihi walatahrimni kabula hasana tihiyahadiyan illhakal mubini"
  },
  {
    "en": "O Allah, on this day, open for me the doors of the heavens, and lock the doors of Hell from me, help me to recite the Qur'an, O the One who sends down tranquility into the hearts of believers",
    "ar": "اَللّـهُمَّ افْتَحْ لي فيهِ أبواب الْجِنانِ، وأغلق عَنّي فيهِ أبواب النّيرانِ، وَوَفِّقْني فيهِ لِتِلاوَةِ الْقُرْآنِ، يا مُنْزِلَ السَّكينَةِ فى قُلُوبِ الْمُؤْمِنينَ",
    "trans": "Allahumaftahli fihi abwabal jinani waglikanni fihi abwabannirani wafwafikni fihi litiwatilqurani yamunzilas sakinatifi kulubilmuminina"
  },
  {
    "en": "O Allah, on this day, show me the way to win Your pleasure, do not let Shaytan have a means over me, make Paradise an abode and a resting place for me, O the One who fulfills the requests of the needy.",
    "ar": "اَللّـهُمَّ اجْعَلْ لى فيهِ اِلى مَرْضاتِكَ دَليلاً، وَلا تَجْعَلْ لِلشَّيْطانِ فيهِ عَلَيَّ سَبيلاً، وَاجْعَلِ الْجَنَّةَ لى مَنْزِلاً وَمَقيلاً، يا قاضِيَ حَوائِجِ الطّالِبينَ"
  },
  {
    "en": "O Allah, on this day, open for me the doors of Your Grace, send down on me its blessings, help me towards the causes of Your mercy, and give me a place in the comforts of Paradise, O the one who answers the call of the distressed.",
    "ar": "اَللّـهُمَّ افْتَحْ لى فيهِ أبواب فَضْلِكَ، وَاَنْزِلْ عَلَيَّ فيهِ بَرَكاتِكَ، وَوَفِّقْني فيهِ لِمُوجِباتِ مَرْضاتِكَ، وَاَسْكِنّي فيهِ بُحْبُوحاتِ جَنّاتِكَ، يا مُجيبَ دَعْوَةِ الْمُضْطَرّينَ",
    "trans": "Allhumaf tahli fihi abwabafadlika wanzilalaiya fihi barakatika wawafikni fihi limujibati mardatika waskini fihi yuhbuhati jannatika yamuhiba dawatilmudutarina"
  },
  {
    "en": "O Allah, on this day, wash away my sins, purify me from all flaws, examine my heart with (for) the piety of the hearts, O One who overlooks the shortcomings of the sinners.",
    "ar": "اَللّـهُمَّ اغْسِلْني فيهِ مِنَ الذُّنُوبِ، وَطَهِّرْني فيهِ مِنَ الْعُيُوبِ، وَامْتَحِنْ قَلْبي فيهِ بِتَقْوَى الْقُلُوبِ، يا مُقيلَ عَثَراتِ الْمُذْنِبينَ"
  },
  {
    "en": "O Allah, on this day, I ask You for what pleases You, and I seek refuge in You from what displeases You, I ask You to grant me the opportunity to obey You and not disobey You, O One who is generous with those who ask.",
    "ar": "اَللّـهُمَّ إني أسألك فيهِ ما يُرْضيكَ، وأعوذ بِكَ مِمّا يُؤْذيكَ، وأسألك التَّوْفيقَ فيهِ لاِنْ أطيعك وَلا أعصيك، يا جَوادَ السّائِلينَ",
    "trans": "Allahumma inni asaluka fihi mayurdika waauzubika mimma tuzika wasaluka fihi lianutika walaasika yajawadasailina"
  },
  {
    "en": "O Allah, on this day, make me among those who love Your friends, and hate Your enemies, following the way of Your last Prophet, O the Guardian of the hearts of the Prophets.",
    "ar": "اَللّـهُمَّ اجْعَلْني فيهِ مُحِبَّاً لأوليائك، وَمُعادِياً لأعدائك، مُسْتَنّاً بِسُنَّةِ خاتَمِ أنبيائك، يا عاصِمَ قُلُوبِ النَّبِيّينَ"
  },
  {
    "en": "O Allah, on this day, make my efforts worthy of appreciation, and my sins forgiven, my deeds accepted, my flaws concealed, O the best of those who hear.",
    "ar": "اَللّـهُمَّ اجْعَلْ سَعْيي فيهِ مَشْكُوراً، وَذَنْبي فيهِ مَغْفُوراً وَعَمَلي فيهِ مَقْبُولاً، وَعَيْبي فيهِ مَسْتُوراً، يا اَسْمَعَ السّامِعينَ",
    "trans": "Allahummajalni sayifihi mashkuran wazanbi fihi magfuranwa amalifihi magbulan waibifihi masturan yaasmas samiina"
  },
  {
    "en": "O Allah, on this day, bestow on me the blessings of Laylatul Qadr, change my affairs from (being) difficult to (being) easy, accept my apologies, and decrease for me [my] sins and burdens, O the Compassionate with His righteous servants.",
    "ar": "اَللّـهُمَّ ارْزُقْني فيهِ فَضْلَ لَيْلَةِ الْقَدْرِ، وَصَيِّرْ أموري فيهِ مِنَ الْعُسْرِ إلى الْيُسْرِ، وَاقْبَلْ مَعاذيري، وَحُطَّ عَنّيِ الذَّنْبَ وَالْوِزْرَ، يا رَؤوفاً بِعِبادِهِ الصّالِحينَ"
  },
  {
    "en": "O Allah, on this day, grant me a share in its nawafil (recommended prayers), honor me by attending to my problems, make closer the means to approach You, from all the means, O One who is not preoccupied by the requests of the beseechers.",
    "ar": "اَللّـهُمَّ وَفِّرْ حَظّي فيهِ مِنَ النَّوافِلِ، وأكرمني فيهِ بإحضار الْمَسائِلِ، وَقَرِّبْ فيهِ وسيلتي إليك مِنْ بَيْنِ الْوَسائِلِ، يا مَنْ لا يَشْغَلُهُ إلحاح الْمُلِحّينَ",
    "trans": "Allahumma wafirhazzi fihi minnanawa filiwakrimni fihibihdarilmasaa iliwakaribfihi wasilstiilayka minbaynilwasaaili yaman layashgaluhul mulihina"
  },
  {
    "en": "O Allah, on this day, cover me with Your mercy, grant me in it success and protection, purify my heart from the darkness of false accusations, O the Merciful to His believing servants.",
    "ar": "اَللّـهُمَّ غَشِّني فيهِ بِالرَّحْمَةِ ، وَارْزُقْني فيهِ التَّوْفيقَ وَالْعِصْمَةَ ، وَطَهِّرْ قَلْبي مِنْ غَياهِبِ التُّهْمَةِ ، يا رَحيماً بِعِبادِهِ الْمُؤْمِنينَ"
  },
  {
    "en": "O Allah, on this day, make my fasts worthy of appreciation and acceptance, according to what pleases You, and pleases the Messenger, the branches being strengthened by the roots, for the sake of our leader, Muhammad, and his purified family. Praise be to Allah, the Lord of the worlds.",
    "ar": "اَللّـهُمَّ اجْعَلْ صِيامى فيهِ بِالشُّكْرِ وَالْقَبُولِ عَلى ما تَرْضاهُ وَيَرْضاهُ الرَّسُولُ، مُحْكَمَةً فُرُوعُهُ بِالاْصُولِ، بِحَقِّ سَيِّدِنا مُحَمَّد وَآلِهِ الطّاهِرينَ، وَالْحَمْدُ للهِ رَبِّ الْعالَمينَ",
    "trans": "Allhumaj al siyamifihi bishukari walkubuli alamatardahu wayardahu rasulu mukahmatan furuhu bilusuli bihak sayidina muhamadiu walihitahirina walhamdullilahi rabilalamina"
  }
]
